{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "0",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 4,
            "content": "1",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 5,
            "content": "2",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 6,
            "content": "3",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 7,
            "content": "4",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 8,
            "content": "5",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 9,
            "content": "6",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 10,
            "content": "7",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 11,
            "content": "8",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 12,
            "content": "9",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "0": 3,
            "1": 4,
            "2": 5,
            "3": 6,
            "4": 7,
            "5": 8,
            "6": 9,
            "7": 10,
            "8": 11,
            "9": 12,
            "!": 13,
            ",": 14,
            ".": 15,
            "?": 16,
            "A": 17,
            "B": 18,
            "C": 19,
            "D": 20,
            "E": 21,
            "F": 22,
            "G": 23,
            "H": 24,
            "I": 25,
            "J": 26,
            "K": 27,
            "L": 28,
            "M": 29,
            "N": 30,
            "O": 31,
            "P": 32,
            "Q": 33,
            "R": 34,
            "S": 35,
            "T": 36,
            "U": 37,
            "V": 38,
            "W": 39,
            "X": 40,
            "Y": 41,
            "Z": 42,
            "a": 43,
            "b": 44,
            "c": 45,
            "d": 46,
            "e": 47,
            "f": 48,
            "g": 49,
            "h": 50,
            "i": 51,
            "j": 52,
            "k": 53,
            "l": 54,
            "m": 55,
            "n": 56,
            "o": 57,
            "p": 58,
            "q": 59,
            "r": 60,
            "s": 61,
            "t": 62,
            "u": 63,
            "v": 64,
            "w": 65,
            "x": 66,
            "y": 67,
            "z": 68,
            "à": 69,
            "á": 70,
            "â": 71,
            "ã": 72,
            "è": 73,
            "é": 74,
            "ê": 75,
            "ì": 76,
            "í": 77,
            "ò": 78,
            "ó": 79,
            "ô": 80,
            "õ": 81,
            "ù": 82,
            "ú": 83,
            "ý": 84,
            "ă": 85,
            "đ": 86,
            "ĩ": 87,
            "ũ": 88,
            "ơ": 89,
            "ư": 90,
            "ạ": 91,
            "ả": 92,
            "ấ": 93,
            "ầ": 94,
            "ẩ": 95,
            "ẫ": 96,
            "ậ": 97,
            "ắ": 98,
            "ằ": 99,
            "ẳ": 100,
            "ẵ": 101,
            "ặ": 102,
            "ẹ": 103,
            "ẻ": 104,
            "ẽ": 105,
            "ế": 106,
            "ề": 107,
            "ể": 108,
            "ễ": 109,
            "ệ": 110,
            "ỉ": 111,
            "ị": 112,
            "ọ": 113,
            "ỏ": 114,
            "ố": 115,
            "ồ": 116,
            "ổ": 117,
            "ỗ": 118,
            "ộ": 119,
            "ớ": 120,
            "ờ": 121,
            "ở": 122,
            "ỡ": 123,
            "ợ": 124,
            "ụ": 125,
            "ủ": 126,
            "ứ": 127,
            "ừ": 128,
            "ử": 129,
            "ữ": 130,
            "ự": 131,
            "ỳ": 132,
            "ỵ": 133,
            "ỷ": 134,
            "ỹ": 135,
            "ng": 136,
            "nh": 137,
            "th": 138,
            "ch": 139,
            "kh": 140,
            "tr": 141,
            "ông": 142,
            "và": 143,
            "ủa": 144,
            "của": 145,
            "ôi": 146,
            "ph": 147,
            "ột": 148,
            "là": 149,
            "ời": 150,
            "một": 151,
            "gi": 152,
            "không": 153,
            "ên": 154,
            "có": 155,
            "ất": 156,
            "iế": 157,
            "tôi": 158,
            "anh": 159,
            "iệ": 160,
            "ta": 161,
            "ượ": 162,
            "ới": 163,
            "ác": 164,
            "nó": 165,
            "qu": 166,
            "ười": 167,
            "đã": 168,
            "ong": 169,
            "ấy": 170,
            "đó": 171,
            "ược": 172,
            "người": 173,
            "ạn": 174,
            "nà": 175,
            "được": 176,
            "đi": 177,
            "ại": 178,
            "như": 179,
            "ững": 180,
            "trong": 181,
            "ều": 182,
            "với": 183,
            "ình": 184,
            "uy": 185,
            "an": 186,
            "những": 187,
            "thể": 188,
            "cho": 189,
            "úng": 190,
            "bạn": 191,
            "ngh": 192,
            "sẽ": 193,
            "sự": 194,
            "ằng": 195,
            "ải": 196,
            "nói": 197,
            "này": 198,
            "ra": 199,
            "on": 200,
            "ến": 201,
            "họ": 202,
            "các": 203,
            "cả": 204,
            "ần": 205,
            "cá": 206,
            "ai": 207,
            "iên": 208,
            "àn": 209,
            "để": 210,
            "khi": 211,
            "ân": 212,
            "chúng": 213,
            "ay": 214,
            "cô": 215,
            "đến": 216,
            "ao": 217,
            "Tôi": 218,
            "ối": 219,
            "ướ": 220,
            "gì": 221,
            "iết": 222,
            "au": 223,
            "ho": 224,
            "ây": 225,
            "ang": 226,
            "Ch": 227,
            "về": 228,
            "ống": 229,
            "rằng": 230,
            "điều": 231,
            "ết": 232,
            "phải": 233,
            "iện": 234,
            "Nh": 235,
            "ài": 236,
            "làm": 237,
            "ực": 238,
            "ầu": 239,
            "ơn": 240,
            "ận": 241,
            "ước": 242,
            "ti": 243,
            "mà": 244,
            "ức": 245,
            "ườ": 246,
            "ành": 247,
            "từ": 248,
            "ươ": 249,
            "ường": 250,
            "ật": 251,
            "mình": 252,
            "lại": 253,
            "ính": 254,
            "vào": 255
        },
        "merges": [
            "n g",
            "n h",
            "t h",
            "c h",
            "k h",
            "t r",
            "ô ng",
            "v à",
            "ủ a",
            "c ủa",
            "ô i",
            "p h",
            "ộ t",
            "l à",
            "ờ i",
            "m ột",
            "g i",
            "kh ông",
            "ê n",
            "c ó",
            "ấ t",
            "i ế",
            "t ôi",
            "a nh",
            "i ệ",
            "t a",
            "ư ợ",
            "ớ i",
            "á c",
            "n ó",
            "q u",
            "ư ời",
            "đ ã",
            "o ng",
            "ấ y",
            "đ ó",
            "ượ c",
            "ng ười",
            "ạ n",
            "n à",
            "đ ược",
            "đ i",
            "ạ i",
            "nh ư",
            "ữ ng",
            "tr ong",
            "ề u",
            "v ới",
            "ì nh",
            "u y",
            "a n",
            "nh ững",
            "th ể",
            "ch o",
            "ú ng",
            "b ạn",
            "ng h",
            "s ẽ",
            "s ự",
            "ằ ng",
            "ả i",
            "nó i",
            "nà y",
            "r a",
            "o n",
            "ế n",
            "h ọ",
            "c ác",
            "c ả",
            "ầ n",
            "c á",
            "a i",
            "i ên",
            "à n",
            "đ ể",
            "kh i",
            "â n",
            "ch úng",
            "a y",
            "c ô",
            "đ ến",
            "a o",
            "T ôi",
            "ố i",
            "ư ớ",
            "g ì",
            "iế t",
            "a u",
            "h o",
            "â y",
            "a ng",
            "C h",
            "v ề",
            "ố ng",
            "r ằng",
            "đi ều",
            "ế t",
            "ph ải",
            "iệ n",
            "N h",
            "à i",
            "là m",
            "ự c",
            "ầ u",
            "ơ n",
            "ậ n",
            "ướ c",
            "t i",
            "m à",
            "ứ c",
            "ư ờ",
            "à nh",
            "t ừ",
            "ư ơ",
            "ườ ng",
            "ậ t",
            "m ình",
            "l ại",
            "í nh",
            "và o"
        ],
        "language": "vi"
    }
}